Revit 2026 API

# ComponentRotation Enumeration

---

ComponentRotation property of DividedSurface. See DividedSurface.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ComponentRotation
```
```vb
Public Enumeration ComponentRotation
```
```cpp
public enum class ComponentRotation
```
```fsharp
type ComponentRotation
```

| Member name | Value | Description |
| --- | --- | --- |
| Angle0 | 0 |  |
| Angle180 | 180 |  |
| Angle270 | 270 |  |
| Angle90 | 90 |  |

#### Reference

Autodesk.Revit.DB Namespace